/*
 * merry_christmas.c
 * 
 *   Created on : 2024-09-23
 *       Author : Janguk.Kim
 * problem name : 메리크리스마스
 *       status : Clear
 */


#include <stdio.h>


int main(void)
{
    printf("##  ##     ##     #####    #####    ##  ##            ##  ##            ##   ##    ##      ####\n");
    printf("##  ##    ####    ##  ##   ##  ##   ##  ##            ##  ##            ### ###   ####    ##  ##\n");
    printf("##  ##   ##  ##   ##  ##   ##  ##   ##  ##             ####             #######  ##  ##   ##\n");
    printf("######   ######   #####    #####     ####               ##     ######   ## # ##  ######    ####\n");
    printf("##  ##   ##  ##   ##       ##         ##               ####             ##   ##  ##  ##       ##\n");
    printf("##  ##   ##  ##   ##       ##         ##              ##  ##            ##   ##  ##  ##   ##  ##\n");
    printf("##  ##   ##  ##   ##       ##         ##              ##  ##            ##   ##  ##  ##    ####\n");
   return 0;
}